[
  {
    "id": "ch1_q1",
    "figure_number": "1.1",
    "question_text": "The image shows a choristoma. What is the defining feature of a choristoma?",
    "image_url": "/data/chapters/chapter1/images/figure_1_1.jpg",
    "option_a": "Abnormal growth of normal tissue",
    "option_b": "Normal tissue in an abnormal location",
    "option_c": "Malignant cellular transformation",
    "option_d": "Inflammation of normal tissue",
    "correct_answer": "B",
    "explanation": "A choristoma is defined as normal tissue found in an abnormal location. It is a congenital anomaly, not a neoplastic process. In the eye, choristomas commonly consist of dermoid tissue and can be found on the conjunctiva, cornea, or eyelid.",
    "chapter": "1",
    "category": "developmental_anomaly",
    "difficulty": "medium"
  },
  {
    "id": "ch1_q2",
    "figure_number": "1.2",
    "question_text": "This image demonstrates a process of corneal opacity. What is the most likely diagnosis?",
    "image_url": "/data/chapters/chapter1/images/figure_1_2.jpg",
    "option_a": "Corneal dystrophy",
    "option_b": "Keratoconus",
    "option_c": "Band keratopathy",
    "option_d": "Arcus senilis",
    "correct_answer": "C",
    "explanation": "The image shows band keratopathy, which is characterized by calcium deposition in the Bowman layer of the cornea, typically in a horizontal band pattern. It is commonly associated with chronic uveitis, hypercalcemia, and chronic ocular inflammation.",
    "chapter": "1",
    "category": "dystrophy_and_degeneration",
    "difficulty": "medium"
  },
  {
    "id": "ch1_q3",
    "figure_number": "1.3",
    "question_text": "The image shows granulomatous inflammation. Which of the following cells is most characteristic of granulomatous inflammation?",
    "image_url": "/data/chapters/chapter1/images/figure_1_3.jpg",
    "option_a": "Neutrophils",
    "option_b": "Eosinophils",
    "option_c": "Epithelioid macrophages",
    "option_d": "Plasma cells",
    "correct_answer": "C",
    "explanation": "Granulomatous inflammation is characterized by the presence of epithelioid macrophages, which may fuse to form multinucleated giant cells. These are the hallmark cells of granulomatous inflammation, which is a distinctive pattern of chronic inflammation seen in conditions such as tuberculosis, sarcoidosis, and some foreign body reactions.",
    "chapter": "1",
    "category": "inflammation",
    "difficulty": "hard"
  },
  {
    "id": "ch1_q4",
    "figure_number": "1.4",
    "question_text": "The image demonstrates a neoplastic process. Which of the following describes a feature of benign neoplasms?",
    "image_url": "/data/chapters/chapter1/images/figure_1_4.jpg",
    "option_a": "Rapid growth",
    "option_b": "Cellular pleomorphism",
    "option_c": "Well-defined borders",
    "option_d": "Vascular invasion",
    "correct_answer": "C",
    "explanation": "Benign neoplasms typically have well-defined borders and are often encapsulated. They also tend to have slower growth rates, less cellular pleomorphism, minimal to no mitotic activity, and lack features such as invasiveness or metastasis that are characteristic of malignant tumors.",
    "chapter": "1",
    "category": "neoplasia",
    "difficulty": "easy"
  },
  {
    "id": "ch1_q5",
    "figure_number": "1.5",
    "question_text": "The image shows an inflammatory process in the conjunctiva. Which cell type predominates in acute inflammatory responses?",
    "image_url": "/data/chapters/chapter1/images/figure_1_5.jpg",
    "option_a": "Neutrophils",
    "option_b": "Lymphocytes",
    "option_c": "Macrophages",
    "option_d": "Fibroblasts",
    "correct_answer": "A",
    "explanation": "Neutrophils are the predominant cell type in acute inflammatory responses. They are the first leukocytes to migrate to the site of inflammation and play a key role in the early defense against infection, particularly bacterial infections. Neutrophils have multi-lobed nuclei and contain granules with antimicrobial proteins and enzymes.",
    "chapter": "1",
    "category": "inflammation",
    "difficulty": "easy"
  },
  {
    "id": "ch1_q6",
    "figure_number": "1.6",
    "question_text": "The image shows phthisis bulbi. Which of the following is the best description of phthisis bulbi?",
    "image_url": "/data/chapters/chapter1/images/figure_1_6.jpg",
    "option_a": "Acute bacterial infection of the eye",
    "option_b": "Ischemic necrosis of the retina",
    "option_c": "End-stage ocular degeneration with atrophy and shrinkage",
    "option_d": "Traumatic rupture of the globe",
    "correct_answer": "C",
    "explanation": "Phthisis bulbi represents end-stage ocular degeneration characterized by atrophy, disorganization, and shrinkage of the globe. It is often the result of severe ocular trauma, inflammation, or disease that leads to loss of intraocular pressure and subsequent collapse of the eye.",
    "chapter": "1",
    "category": "dystrophy_and_degeneration",
    "difficulty": "medium"
  }
]
